*Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.*

_1. Создать репозиторий на GitHub_ - Выполненно

_2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)_

терминатор: start
процесс: array = { "abc", "defg", "hi", "jklm", "no" }
данные: newArray
условие: if (str.Length <= 3)
вывод данных: Console.WriteLine(str)
терминатор: end

_3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)_ - готово

