*Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.*

_1. Создать репозиторий на GitHub_ - Выполненно

_2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)_

терминатор: start // начало проги
процесс: array = { "abc", "defg", "hi", "jklm", "no" } // инициализация массива
данные: newArray // новый массив
условие: if (str.Length <= 3) // проверка на "меньше 3" и добавление в новый массив того, что прошло проверку
вывод данных: Console.WriteLine(str) // вывод нового полученного массива
терминатор: end // конец

_3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)_ - готово

_4. Написать программу, решающую поставленную задачу_

array = { "abc", "defg", "hi", "jklm", "no" };

newArray = array.Where(str => str.Length <= 3).ToArray();

Console.WriteLine("Новый массив с строками, длина которых меньше или равна 3:");

foreach (string str in newArray)

        {
        Console.WriteLine(str);
        }

